Revit 2027 API
BuiltInFailures.StairRampFailures.MultistoryStandardStairTopEndExceedsOrNotReach Property
 One of the stairs inside multistory stairs top ends exceed or cannot reach the top elevation of the stair.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MultistoryStandardStairTopEndExceedsOrNotReach { get; }
Public Shared ReadOnly Property MultistoryStandardStairTopEndExceedsOrNotReach As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MultistoryStandardStairTopEndExceedsOrNotReach {
	FailureDefinitionId^ get ();
}
static member MultistoryStandardStairTopEndExceedsOrNotReach : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace